# Treating data, fixing data issues

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('Data Source/aluguel_residencial.csv', sep=';')

In [3]:
# Check not a number records
data.isnull()

        Tipo  Bairro  Quartos  Vagas  Suites   Area  Valor  Condominio   IPTU
0      False   False    False  False   False  False  False       False  False
1      False   False    False  False   False  False  False        True   True
2      False   False    False  False   False  False  False       False  False
3      False   False    False  False   False  False  False       False   True
4      False   False    False  False   False  False  False        True   True
...      ...     ...      ...    ...     ...    ...    ...         ...    ...
22575  False   False    False  False   False  False  False       False  False
22576  False   False    False  False   False  False  False       False  False
22577  False   False    False  False   False  False  False       False  False
22578  False   False    False  False   False  False  False       False  False
22579  False   False    False  False   False  False  False       False   True

[22580 rows x 9 columns]

In [4]:
# Data frame info can help you to get nullable data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22580 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22580 non-null  object
 1   Bairro      22580 non-null  object
 2   Quartos     22580 non-null  int64
 3   Vagas       22580 non-null  int64
 4   Suites      22580 non-null  int64
 5   Area        22580 non-null  int64
 6   Valor       22571 non-null  float64
 7   Condominio  20765 non-null  float64
 8   IPTU        15795 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.6+ MB

In [5]:
# Droping null records from Valor column
data.dropna(subset=['Valor'], inplace=True)

In [6]:
data[data['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

## Trating missing data with some conditions

In [7]:
# Null Condominio records
data[data['Condominio'].isnull()].shape[0]

1813

In [8]:
select = (data['Tipo'] == 'Apartamento') & (data['Condominio'].isnull())

In [10]:
data = data[~select]

In [11]:
data[data['Condominio'].isnull()].shape[0]

1068

In [12]:
# Filling nan values as 0
data = data.fillna({'Condominio': 0, 'IPTU':0})

In [14]:
data[data['Condominio'].isnull()].shape[0]
data[data['IPTU'].isnull()].shape[0]

0

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21826 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        21826 non-null  object
 1   Bairro      21826 non-null  object
 2   Quartos     21826 non-null  int64
 3   Vagas       21826 non-null  int64
 4   Suites      21826 non-null  int64
 5   Area        21826 non-null  int64
 6   Valor       21826 non-null  float64
 7   Condominio  21826 non-null  float64
 8   IPTU        21826 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

In [17]:
data.to_csv('Data Source/aluguel_residencial_tratado.csv', sep=';', index=False)